# SteelElemWeldMainSurfaceshape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldMainSurfaceshape Property
ParameterTypeId Class See Also
---
"Surface Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldMainSurfaceshape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldMainSurfaceshape As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldMainSurfaceshape {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace